tap "homebrew/services"
tap "homebrew/cask"

# Dev tools
brew "universal-ctags"
brew "git"
brew "openssl"
brew "the_silver_searcher"
brew "tmux"
brew "neovim"
brew "zsh"
brew "openssh"
brew "curl"
brew "wget"
brew "htop"
brew "gcc"
cask "wireshark"

#Browsing
cask "firefox"
cask "brave-browser"

# GitHub
brew "gh"

#Containerization/VM
cask "docker"

# Image, Audio, Video
brew "imagemagick"
brew "ffmpeg"
brew "yt-dlp"
cask "spotify"
cask "vlc"

# PDF Rendering
brew "poppler"

# Programming language prerequisites and package managers
brew "libyaml" # should come after openssl
brew "coreutils"
brew "yarn"  #this shouldnt install anversion of node, only require node to function which will be installed later
cask "gpg-suite-no-mail"

# Databases - commented out as not needed currently 
#brew "postgresql@14", restart_service: :changed
#brew "redis", restart_service: :changed